23127209/HW5/submission/23127209_Load_20260816_Report/statistics.json
{
  "03 Search Products" : {
    "transaction" : "03 Search Products",
    "sampleCount" : 350,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.5885714285714303,
    "medianResTime" : 1.0,
    "minResTime" : 1.0,
    "maxResTime" : 11.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.4499999999999886,
    "pct3ResTime" : 4.490000000000009,
    "throughput" : 1.504205328325046,
    "receivedKBytesPerSec" : 0.6794567656469587,
    "sentKBytesPerSec" : 0.2952548567029538
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2087,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.998562529947291,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 44.0,
    "pct1ResTime" : 10.0,
    "pct2ResTime" : 11.0,
    "pct3ResTime" : 12.0,
    "throughput" : 8.802044672380053,
    "receivedKBytesPerSec" : 3.6505316825633476,
    "sentKBytesPerSec" : 2.441146771300779
  },
  "02 FR-14 List Categories" : {
    "transaction" : "02 FR-14 List Categories",
    "sampleCount" : 353,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.5864022662889503,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 11.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 3.0,
    "throughput" : 1.507780231420773,
    "receivedKBytesPerSec" : 0.5271341043443719,
    "sentKBytesPerSec" : 0.27681902686240756
  },
  "04 Product Detail" : {
    "transaction" : "04 Product Detail",
    "sampleCount" : 347,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.5907780979827086,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 8.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 3.519999999999982,
    "throughput" : 1.5019434368967337,
    "receivedKBytesPerSec" : 0.6766539908628167,
    "sentKBytesPerSec" : 0.27574742786775974
  },
  "01 FR-02 Login" : {
    "transaction" : "01 FR-02 Login",
    "sampleCount" : 356,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.359550561797754,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 44.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 11.430000000000007,
    "throughput" : 1.5032387193757337,
    "receivedKBytesPerSec" : 0.9528682143128594,
    "sentKBytesPerSec" : 0.37727768640582376
  },
  "05 Add Product To Cart" : {
    "transaction" : "05 Add Product To Cart",
    "sampleCount" : 341,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.442815249266862,
    "medianResTime" : 1.0,
    "minResTime" : 1.0,
    "maxResTime" : 4.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 3.0,
    "throughput" : 1.4909189482244511,
    "receivedKBytesPerSec" : 0.42805680740037955,
    "sentKBytesPerSec" : 0.6264067883266731
  },
  "E2E Shopping Journey" : {
    "transaction" : "E2E Shopping Journey",
    "sampleCount" : 341,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 18.149560117302048,
    "medianResTime" : 18.0,
    "minResTime" : 5.0,
    "maxResTime" : 92.0,
    "pct1ResTime" : 22.0,
    "pct2ResTime" : 23.899999999999977,
    "pct3ResTime" : 29.0,
    "throughput" : 1.4876278225665724,
    "receivedKBytesPerSec" : 3.6869085684199736,
    "sentKBytesPerSec" : 2.4865142829721147
  },
  "06 FR-08 Checkout" : {
    "transaction" : "06 FR-08 Checkout",
    "sampleCount" : 340,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9.582352941176477,
    "medianResTime" : 10.0,
    "minResTime" : 5.0,
    "maxResTime" : 36.0,
    "pct1ResTime" : 11.0,
    "pct2ResTime" : 12.0,
    "pct3ResTime" : 16.0,
    "throughput" : 1.5011236351916362,
    "receivedKBytesPerSec" : 0.45983983783449667,
    "sentKBytesPerSec" : 0.6577203216267765
  }
}