23127209/HW5/submission/23127209_Spike_20260816_Report/statistics.json
{
  "03 Search Products" : {
    "transaction" : "03 Search Products",
    "sampleCount" : 688,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.7514534883720942,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 11.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 8.0,
    "throughput" : 2.8905376904267746,
    "receivedKBytesPerSec" : 1.3058812450633985,
    "sentKBytesPerSec" : 0.5673809333747868
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 4087,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.823831661365309,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 46.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 10.0,
    "pct3ResTime" : 11.0,
    "throughput" : 16.60936496712264,
    "receivedKBytesPerSec" : 6.921728920035681,
    "sentKBytesPerSec" : 4.57668274213016
  },
  "02 FR-14 List Categories" : {
    "transaction" : "02 FR-14 List Categories",
    "sampleCount" : 703,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.779516358463727,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 17.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 8.960000000000036,
    "throughput" : 2.8903635361932722,
    "receivedKBytesPerSec" : 1.0104981894113196,
    "sentKBytesPerSec" : 0.5306526804729835
  },
  "04 Product Detail" : {
    "transaction" : "04 Product Detail",
    "sampleCount" : 677,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.8138847858197948,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 11.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.1000000000000227,
    "pct3ResTime" : 7.220000000000027,
    "throughput" : 2.854949985661994,
    "receivedKBytesPerSec" : 1.286487622136616,
    "sentKBytesPerSec" : 0.5241509739301318
  },
  "01 FR-02 Login" : {
    "transaction" : "01 FR-02 Login",
    "sampleCount" : 720,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.5277777777777772,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 46.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 11.0,
    "throughput" : 2.9402636436400464,
    "receivedKBytesPerSec" : 1.8630084397307207,
    "sentKBytesPerSec" : 0.7379372621245038
  },
  "05 Add Product To Cart" : {
    "transaction" : "05 Add Product To Cart",
    "sampleCount" : 660,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.375757575757576,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 3.0,
    "throughput" : 2.7855741026019794,
    "receivedKBytesPerSec" : 0.7997644396142402,
    "sentKBytesPerSec" : 1.169946069069576
  },
  "E2E Shopping Journey" : {
    "transaction" : "E2E Shopping Journey",
    "sampleCount" : 660,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 17.022727272727273,
    "medianResTime" : 16.0,
    "minResTime" : 5.0,
    "maxResTime" : 88.0,
    "pct1ResTime" : 22.0,
    "pct2ResTime" : 24.0,
    "pct3ResTime" : 39.0,
    "throughput" : 2.7429369373862302,
    "receivedKBytesPerSec" : 6.773630492627318,
    "sentKBytesPerSec" : 4.54910555190177
  },
  "06 FR-08 Checkout" : {
    "transaction" : "06 FR-08 Checkout",
    "sampleCount" : 639,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8.026604068857582,
    "medianResTime" : 7.0,
    "minResTime" : 4.0,
    "maxResTime" : 34.0,
    "pct1ResTime" : 11.0,
    "pct2ResTime" : 11.0,
    "pct3ResTime" : 31.600000000000023,
    "throughput" : 2.726679211951304,
    "receivedKBytesPerSec" : 0.8356605716425362,
    "sentKBytesPerSec" : 1.194172283241804
  }
}